ИнКар.Маркетплейсы/src/Catalogs/МП_Профили/МП_Профили.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МП_Профили</name>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.МП_ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделительРазделов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьКартинки</name>
    <type>
      <types>EnumRef.МП_ВариантыПубликацииКартинок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьМоделиАвтомобилей</name>
    <type>
      <types>EnumRef.МП_ВариантыПубликацииМоделейАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МоделиШапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МоделиПодвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВедущийМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантФормированияНаличия</name>
    <type>
      <types>EnumRef.МП_ВариантыФормированияНаличия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОсновной</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеШапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеПодвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОНедоступности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПредставленияСкладов</name>
    <type>
      <types>EnumRef.МП_ВариантыПредставленияСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьПроизводителя</name>
    <type>
      <types>EnumRef.МП_ВариантыИспользованияПроизводителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьОписаниеВида</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьОписаниеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт</name>
    <comment>&lt;AllowEmail>Нет&lt;/AllowEmail></comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитВидео</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗоныПоказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Shop_name</name>
    <comment>Короткое название магазина. В названии нельзя использовать слова, которые не относятся к наименованию магазина (например «лучший», «дешевый»), указывать номер телефона и т. п.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shop_company</name>
    <comment>Полное наименование компании, владеющей магазином. Не публикуется.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shop_url</name>
    <comment>URL главной страницы магазина. Максимальная длина ссылки — 2048 символов. Допускаются кириллические ссылки. URL‑адрес формируется на основе стандарта RFC 3986</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Shop_email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОбъявления</name>
    <comment>&lt;Category>Запчасти и аксессуары&lt;/Category></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗоныПоказа</name>
    <attributes>
      <name>ЗонаПоказа</name>
      <type>
        <types>CatalogRef.МП_АвитоЗоныПоказа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СегментыНоменклатуры</name>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОсновнойСегмент</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПлатногоРазмещения</name>
      <comment>&lt;ListingFee>PackageSingle&lt;/ListingFee></comment>
      <type>
        <types>EnumRef.МП_АвитоВариантыПлатногоРазмещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатнаяУслуга</name>
      <comment>&lt;AdStatus>x10_7&lt;/AdStatus></comment>
      <type>
        <types>CatalogRef.МП_АвитоПлатныеУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОбъявления</name>
      <comment>&lt;AdType>Товар от производителя&lt;/AdType></comment>
      <type>
        <types>EnumRef.МП_АвитоВидыОбъявлений</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <comment>&lt;Condition>Новое&lt;/Condition></comment>
      <type>
        <types>EnumRef.МП_АвитоСостояние</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/МП_КатегорииYML/МП_КатегорииYML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_КатегорииYML</name>
  <resources>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>parentId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвитоПодкатегорияТоваров</name>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/РаспределениеЗапасов/РаспределениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45342faa-1ece-480b-81d1-d8e80e853d58">
  <name>РаспределениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="63380d67-a9d1-4dad-8840-41c7249204ab">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce0d4416-9083-47d2-9ac4-20bebe7a8b22">
    <name>Резерв</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b1640808-e7c6-4807-936d-bd90cf45049d">
    <name>Свободно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="261e7ab2-2140-4288-a9b8-49b2ba6ae33a">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="2a3bab03-6376-456d-9d36-7b51914fe435">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="071db416-83a1-49bb-8727-0c50e9b7962d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="908bbc1b-86a0-43c8-b40a-a1c31cf89ac3">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7ebc9523-5df4-4dfc-ab70-41061e5b8b4f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/Enums/РаспределениеЗапасовСостояния/РаспределениеЗапасовСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="545815ed-aef9-41ce-93e4-8bbe4895c3db">
  <name>РаспределениеЗапасовСостояния</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="47d10a43-5556-4259-bde6-880106968b77">
    <name>ОстатокНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/МП_ВидыМаркетплейсов/МП_ВидыМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_ВидыМаркетплейсов</name>
  <enumValues>
    <name>VK</name>
  </enumValues>
  <enumValues>
    <name>ДРОМ</name>
  </enumValues>
  <enumValues>
    <name>Avito</name>
  </enumValues>
  <enumValues>
    <name>СберМегаМаркет</name>
  </enumValues>
  <enumValues>
    <name>Юла</name>
  </enumValues>
  <enumValues>
    <name>ДубльГис</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Catalogs/МП_Профили/ManagerModule.bsl
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращаает массив ссылок на элементы с заполненными реквизитами:
// - Client_id
// - Client_secret
// - URLЗагрузки
// - ИмяФайлаВыгрузки
// 
// Возвращаемое значение:
//  СписокЗначений -- Готовы к автозагрузке
Функция ГотовыКАвтозагрузке() Экспорт

	ГотовыКАвтозагрузке = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	МП_Профили.Ссылка КАК Ссылка,
				   |	КОЛИЧЕСТВО(МП_ПрофилиСегментыНоменклатуры.Сегмент) КАК КоличествоСегментов
				   |ПОМЕСТИТЬ ВТПрофили
				   |ИЗ
				   |	Справочник.МП_Профили КАК МП_Профили
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МП_Профили.СегментыНоменклатуры КАК МП_ПрофилиСегментыНоменклатуры
				   |		ПО МП_ПрофилиСегментыНоменклатуры.Ссылка = МП_Профили.Ссылка
				   |ГДЕ
				   |	МП_Профили.URLЗагрузки <> """"
				   |	И МП_Профили.ИмяФайлаВыгрузки <> """"
				   |	И МП_ПрофилиСегментыНоменклатуры.Сегмент <> ЗНАЧЕНИЕ(Справочник.МП_Профили.ПустаяСсылка)
				   |	И МП_ПрофилиСегментыНоменклатуры.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
				   |СГРУППИРОВАТЬ ПО
				   |	МП_Профили.Ссылка
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТПрофили.Ссылка
				   |ИЗ
				   |	ВТПрофили КАК ВТПрофили
				   |ГДЕ
				   |	ВТПрофили.КоличествоСегментов > 0
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	ВТПрофили.Ссылка.ВидМаркетплейса";

	ЭлементыСправочника = Запрос.Выполнить().Выбрать();

	Пока ЭлементыСправочника.Следующий() Цикл
		ГотовыКАвтозагрузке.Добавить(ЭлементыСправочника.Ссылка);
	КонецЦикла;

	Возврат ГотовыКАвтозагрузке;

КонецФункции

// Возвращает данные для формирования объявлений
// 
// Параметры:
//  Ссылка - СправочникСсылка.МП_Профили - Профиль выгрузки объявлений
// 
// Возвращаемое значение:
//  Структура - Товары профиля:
// * Товары - ВыборкаИзРезультатаЗапроса -
// * Остатки - ВыборкаИзРезультатаЗапроса -
// * Картинки - ВыборкаИзРезультатаЗапроса -
// * Свойства - ВыборкаИзРезультатаЗапроса -
// * Модели - ВыборкаИзРезультатаЗапроса -
Функция ТоварыПрофиля(Ссылка) Экспорт

	СвойствоЮла = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Юла", Истина);

	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВидМаркетплейса");

	КоллекцияСвойств = МП_ДопРеквизитыВызовСервераПовтИсп.ПубликуемыеДопРеквизиты();

	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КоллекцияСвойств", КоллекцияСвойств);
	Запрос.УстановитьПараметр("СвойствоЮла", СвойствоЮла);

	ТекстЗапроса = "ВЫБРАТЬ
				   |	МП_ПрофилиСегментыНоменклатуры.Сегмент КАК Сегмент,
				   |	МП_ПрофилиСегментыНоменклатуры.НомерСтроки КАК Приоритет,
				   |	МП_ПрофилиСегментыНоменклатуры.ВидЦены КАК ВидЦены,
				   |	МП_ПрофилиСегментыНоменклатуры.Скидка КАК Скидка,
				   |	МП_ПрофилиСегментыНоменклатуры.ВариантПлатногоРазмещения КАК ВариантПлатногоРазмещения,
				   |	МП_ПрофилиСегментыНоменклатуры.ПлатнаяУслуга КАК ПлатнаяУслуга,
				   |	МП_ПрофилиСегментыНоменклатуры.Состояние КАК Состояние
				   |ПОМЕСТИТЬ ВТСегментыПодробно
				   |ИЗ
				   |	Справочник.МП_Профили.СегментыНоменклатуры КАК МП_ПрофилиСегментыНоменклатуры
				   |ГДЕ
				   |	МП_ПрофилиСегментыНоменклатуры.Ссылка = &Ссылка
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ДополнительныеСведения.Объект КАК Ссылка,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаКатегории.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаКатегории.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаКатегории.Код
				   |	КОНЕЦ КАК ЮлаКатегория,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаПодкатегории.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаПодкатегории.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаПодкатегории.Код
				   |	КОНЕЦ КАК ЮлаПодкатегория,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаТипыДеталей.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаТипыДеталей.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаТипыДеталей.Код
				   |	КОНЕЦ КАК ЮлаТипДетали,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаГруппыДеталей.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаГруппыДеталей.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаГруппыДеталей.Код
				   |	КОНЕЦ КАК ЮлаГруппаДеталей,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаНазванияДеталей.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаНазванияДеталей.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаНазванияДеталей.Код
				   |	КОНЕЦ КАК ЮлаНазваниеДетали,
				   |	МП_ЮлаПодкатегории.Тег КАК ЮлаТегПодкатегории
				   |ПОМЕСТИТЬ ВТТоварныеКатегории
				   |ИЗ
				   |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаРазмещенияОбъявлений КАК МП_ЮлаРазмещенияОбъявлений
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаКатегории КАК МП_ЮлаКатегории
				   |			ПО МП_ЮлаРазмещенияОбъявлений.Категория = МП_ЮлаКатегории.Ссылка
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаПодкатегории КАК МП_ЮлаПодкатегории
				   |			ПО МП_ЮлаРазмещенияОбъявлений.Подкатегория = МП_ЮлаПодкатегории.Ссылка
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаТипыДеталей КАК МП_ЮлаТипыДеталей
				   |			ПО МП_ЮлаРазмещенияОбъявлений.ТипДетали = МП_ЮлаТипыДеталей.Ссылка
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаГруппыДеталей КАК МП_ЮлаГруппыДеталей
				   |			ПО МП_ЮлаРазмещенияОбъявлений.ГруппаДеталей = МП_ЮлаГруппыДеталей.Ссылка
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаНазванияДеталей КАК МП_ЮлаНазванияДеталей
				   |			ПО МП_ЮлаРазмещенияОбъявлений.НазваниеДетали = МП_ЮлаНазванияДеталей.Ссылка
				   |		ПО МП_ЮлаРазмещенияОбъявлений.Наименование = ДополнительныеСведения.Значение
				   |ГДЕ
				   |	ДополнительныеСведения.Свойство = &СвойствоЮла
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	НоменклатураСегмента.Номенклатура КАК Номенклатура,
				   |	НоменклатураСегмента.Характеристика КАК Характеристика,
				   |	НоменклатураСегмента.Номенклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
				   |	МАКСИМУМ(ВТСегментыПодробно.Приоритет) КАК Приоритет
				   |ПОМЕСТИТЬ ВТНоменклатура
				   |ИЗ
				   |	ВТСегментыПодробно КАК ВТСегментыПодробно
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				   |		ПО ВТСегментыПодробно.Сегмент = НоменклатураСегмента.Сегмент
				   |СГРУППИРОВАТЬ ПО
				   |	НоменклатураСегмента.Номенклатура,
				   |	НоменклатураСегмента.Характеристика,
				   |	НоменклатураСегмента.Номенклатура.ТоварнаяКатегория
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура,
				   |	Характеристика
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТНоменклатура.Номенклатура КАК Номенклатура,
				   |	ВТНоменклатура.Характеристика КАК Характеристика,
				   |	ВТСегментыПодробно.Сегмент КАК Сегмент,
				   |	ВТСегментыПодробно.ВидЦены КАК ВидЦены,
				   |	ВТСегментыПодробно.Скидка КАК Скидка,
				   |	ВТНоменклатура.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
				   |	ВТСегментыПодробно.ВариантПлатногоРазмещения КАК ВариантПлатногоРазмещения,
				   |	ВТСегментыПодробно.ПлатнаяУслуга КАК ПлатнаяУслуга,
				   |	ВТСегментыПодробно.Состояние КАК Состояние,
				   |	ВТНоменклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаКатегория, """") КАК ЮлаКатегория,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаПодкатегория, """") КАК ЮлаПодкатегория,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаТипДетали, """") КАК ЮлаТипДетали,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаГруппаДеталей, """") КАК ЮлаГруппаДеталей,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаНазваниеДетали, """") КАК ЮлаНазваниеДетали,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаТегПодкатегории, """") КАК ЮлаТегПодкатегории
				   |ПОМЕСТИТЬ ВТТовары
				   |ИЗ
				   |	ВТСегментыПодробно КАК ВТСегментыПодробно
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
				   |			ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварныеКатегории КАК ВТТоварныеКатегории
				   |			ПО ВТТоварныеКатегории.Ссылка = ВТНоменклатура.ТоварнаяКатегория
				   |		ПО ВТНоменклатура.Приоритет = ВТСегментыПодробно.Приоритет
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура,
				   |	Характеристика
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТТовары.Номенклатура КАК Номенклатура,
				   |	ВТТовары.Характеристика КАК Характеристика,
				   |	ВТТовары.Сегмент КАК Сегмент,
				   |	ВТТовары.ВидЦены КАК ВидЦены,
				   |	ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
				   |	ВТТовары.Скидка КАК Скидка,
				   |	ЕСТЬNULL(Цены.Цена * (100 - ВТТовары.Скидка) / 100, 0) КАК ЦенаСоСкидкой,
				   |	ВТТовары.Номенклатура.Описание КАК НоменклатураОписание,
				   |	ВТТовары.Номенклатура.Производитель КАК Производитель,
				   |	ВТТовары.Номенклатура.Артикул КАК Артикул,
				   |	ВТТовары.Номенклатура.Код КАК Код,
				   |	ВТТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
				   |	ВТТовары.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
				   |	ЕСТЬNULL(МП_КатегорииYML.id, 7777) КАК categoryId,
				   |	ВТТовары.ВариантПлатногоРазмещения КАК ВариантПлатногоРазмещения,
				   |	ВТТовары.ПлатнаяУслуга КАК ПлатнаяУслуга,
				   |	ВТТовары.Состояние КАК Состояние,
				   |	ЕСТЬNULL(МП_КатегорииYML.АвитоПодкатегорияТоваров.Код, ""00-000"") КАК TypeidAvito,
				   |	0 КАК Ноль,
				   |	ВТТовары.ЮлаКатегория КАК ЮлаКатегория,
				   |	ВТТовары.ЮлаПодкатегория КАК ЮлаПодкатегория,
				   |	ВТТовары.ЮлаТипДетали КАК ЮлаТипДетали,
				   |	ВТТовары.ЮлаГруппаДеталей КАК ЮлаГруппаДеталей,
				   |	ВТТовары.ЮлаНазваниеДетали КАК ЮлаНазваниеДетали,
				   |	ВТТовары.ЮлаТегПодкатегории КАК ЮлаТегПодкатегории
				   |ИЗ
				   |	ВТТовары КАК ВТТовары
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК Цены
				   |		ПО Цены.Номенклатура = ВТТовары.Номенклатура
				   |		И Цены.Характеристика = ВТТовары.Характеристика
				   |		И Цены.ВидЦены = ВТТовары.ВидЦены
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МП_КатегорииYML КАК МП_КатегорииYML
				   |		ПО МП_КатегорииYML.Категория = ВТТовары.ВидНоменклатуры
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
				   |	РаспределениеЗапасов.Характеристика КАК Характеристика,
				   |	СУММА(ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0)) КАК Свободно,
				   |	РаспределениеЗапасов.Склад КАК Склад,
				   |	""<li><strong>"" + СкладыКонтактнаяИнформация.Ссылка.Наименование + ""</strong> ("" + СкладыКонтактнаяИнформация.Город +
				   |		"")"" КАК СкладAvito
				   |ИЗ
				   |	ВТНоменклатура КАК ВТНоменклатура
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
				   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
				   |			ПО СкладыКонтактнаяИнформация.Ссылка = РаспределениеЗапасов.Склад
				   |		ПО РаспределениеЗапасов.Номенклатура = ВТНоменклатура.Номенклатура
				   |		И РаспределениеЗапасов.Характеристика = ВТНоменклатура.Характеристика
				   |ГДЕ
				   |	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
				   |СГРУППИРОВАТЬ ПО
				   |	РаспределениеЗапасов.Номенклатура,
				   |	РаспределениеЗапасов.Характеристика,
				   |	РаспределениеЗапасов.Склад,
				   |	""<li><strong>"" + СкладыКонтактнаяИнформация.Ссылка.Наименование + ""</strong> ("" + СкладыКонтактнаяИнформация.Город +
				   |		"")""
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТНоменклатура.Номенклатура КАК Номенклатура,
				   |	ВТНоменклатура.Характеристика КАК Характеристика,
				   |	НоменклатураПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу
				   |ИЗ
				   |	ВТНоменклатура КАК ВТНоменклатура
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
				   |		ПО НоменклатураПрисоединенныеФайлы.ВладелецФайла = ВТНоменклатура.Номенклатура
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	НоменклатураДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок,
				   |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
				   |	ВТНоменклатура.Номенклатура КАК Номенклатура,
				   |	ВТНоменклатура.Характеристика КАК Характеристика
				   |ИЗ
				   |	ВТНоменклатура КАК ВТНоменклатура
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
				   |		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТНоменклатура.Номенклатура
				   |ГДЕ
				   |	НоменклатураДополнительныеРеквизиты.Свойство В (&КоллекцияСвойств)
				   |	И НоменклатураДополнительныеРеквизиты.Значение <> 0
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	КА2_МоделиАвтомобилейДляНоменклатуры.КлючМодели.Представление КАК КлючМодели,
				   |	ВТНоменклатура.Номенклатура КАК Номенклатура,
				   |	ВТНоменклатура.Характеристика КАК Характеристика
				   |ИЗ
				   |	ВТНоменклатура КАК ВТНоменклатура
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КА2_МоделиАвтомобилейДляНоменклатуры КАК КА2_МоделиАвтомобилейДляНоменклатуры
				   |		ПО КА2_МоделиАвтомобилейДляНоменклатуры.Номенклатура = ВТНоменклатура.Номенклатура
				   |ГДЕ
				   |	КА2_МоделиАвтомобилейДляНоменклатуры.Совместимо = ИСТИНА";

	Если ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.ДРОМ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "0 КАК Ноль", """RUR"" КАК currencyId,
															   |	""Новый"" КАК condition,
															   |	""В наличии"" КАК status");
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	УстановитьПривилегированныйРежим(Истина);

	Результат = Запрос.ВыполнитьПакет();

	ТоварыПрофиля = Новый Структура;

	Товары = Результат[4].Выбрать();
	Остатки = Результат[5].Выбрать();
	Картинки = Результат[6].Выбрать();
	Свойства = Результат[7].Выбрать();
	Модели = Результат[8].Выбрать();

	УстановитьПривилегированныйРежим(Ложь);

	ТоварыПрофиля.Вставить("Товары", Товары);
	ТоварыПрофиля.Вставить("Остатки", Остатки);
	ТоварыПрофиля.Вставить("Картинки", Картинки);
	ТоварыПрофиля.Вставить("Свойства", Свойства);
	ТоварыПрофиля.Вставить("Модели", Модели);

	Возврат ТоварыПрофиля;

КонецФункции

// Возвращает массив наименований зон показа
// 
// Параметры:
//  Ссылка - СправочникСсылка.МП_Профили - Ссылка
// 
// Возвращаемое значение:
//  Массив - Зоны показа
Функция ЗоныПоказа(Ссылка) Экспорт

	Перем Запрос;
	Перем НаборЗонПоказа;

	НаборЗон = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
				   |	ЗоныПоказа.НомерСтроки КАК НомерСтроки,
				   |	ЗоныПоказа.ЗонаПоказа.Наименование КАК НаименованиеЗоны
				   |ИЗ
				   |	Справочник.МП_Профили.ЗоныПоказа КАК ЗоныПоказа
				   |ГДЕ
				   |	ЗоныПоказа.Ссылка = &Ссылка
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	НомерСтроки";
	НаборЗонПоказа = Запрос.Выполнить().Выбрать();

	Пока НаборЗонПоказа.Следующий() Цикл
		НаборЗон.Добавить(НаборЗонПоказа.НаименованиеЗоны);
	КонецЦикла;

	Возврат НаборЗон;

КонецФункции

#КонецОбласти

#КонецЕсли
